# Константы для институтов и специальностей
INSTITUTES = {
    "Институт агроинженерии и пищевых систем": [
        "Агрономия",
        "Технологические машины и оборудование",
        "Технологии пищевых производств",
        "Биотехнология и биоинженерия",
        "Пищевая биотехнология",
        "Продукты питания животного происхождения",
        "Технология продукции и организация общественного питания",
        "Зоотехния",
        "Ветеринария",
        "Ветеринарно-санитарная экспертиза"
    ],
    "Институт цифровых технологий": [
        "Информатика и вычислительная техника (Промышленная информатика и системы управления)",
        "Информационные системы и технологии (Проектирование корпоративных информационных систем)",
        "Прикладная информатика",
        "Бизнес-информатика",
        "Информационная безопасность автоматизированных систем"
    ],
    "Институт рыболовства и аквакультуры": [
        "Водные биоресурсы и аквакультура (Индустриальная аквакультура)",
        "Промышленное рыболовство (Цифровые технологии промышленного рыболовства)"
    ],
    "Институт морских технологий": [
        "Кораблестроение, океанотехника и системотехника объектов морской инфраструктуры",
        "Управление водным транспортом и гидрографическое обеспечение судоходства",
        "Эксплуатация судовых энергетических установок",
        "Эксплуатация судового электрооборудования и средств автоматики",
        "Судовождение",
        "Техническая эксплуатация транспортного радиооборудования",
        "Инженерно-экономическое обеспечение технологий и бизнес-процессов водного транспорта"
    ],
    "Институт энергетики и автоматики": [
        "Теплоэнергетика и теплотехника",
        "Электроэнергетика и электротехника",
        "Автоматизация технологических процессов и производств",
        "Техносферная безопасность (Безопасность технологических процессов и производств)",
        "Техносферная безопасность (Защита в чрезвычайных ситуациях)"
    ],
    "Институт машиностроения": [
        "Машиностроение (Технологии, оборудование и автоматизация машиностроительных производств)",
        "Технологические машины и оборудование"
    ],
    "Институт экономики и управления": [
        "Экономика",
        "Менеджмент"
    ]
}

# Константы для зданий
BUILDINGS = {
    "Главный корпус": {"lat": 54.720683, "lon": 20.498378},
    "Корпус А": {"lat": 54.741312, "lon": 20.513263},
    "Корпус М": {"lat": 54.700411, "lon": 20.511123},
    "Спортивный комплекс": {"lat": 54.700411, "lon": 20.511123}
}