BUILDINGS = {
    "Главный корпус": {"lat": 54.720683, "lon": 20.498378},
    "Корпус А": {"lat": 54.741312, "lon": 20.513263},
    "Корпус М": {"lat": 54.700411, "lon": 20.511123},
    "Спортивный комплекс": {"lat": 54.700411, "lon": 20.511123}
}

DIRECTIONS = [
    "Институт рыболовства и аквакультуры",
    "Институт агроинженерии и пищевых систем",
    "Институт цифровых технологий", 
    "Институт морских технологий, энергетики и строительства",
    "Институт отраслевой экономики и управления"
]

GROUPS = ["ИБ", "ВТ", "ИС", "АП", "ИЭ", "БИ"]
